Repository: flow03/CoM-Archolos-Ukrainian-Translation
Catalog: DialogeOmegaT/omegat/project_save.tmx
Source language: pl
Languages: uk

source: Jesteśmy najlepszymi spośród wszystkich wojowników Innosa. Zajmujemy się ochroną jego kapłanów, magów ognia, oraz walką z pomiotami Beliara.
uk: Ми найкращі з усіх воїнів Інноса. Ми захищаємо його жерців, Магів Вогню, і боремося з породженнями Беліара.

source: Jesteśmy najlepszymi wojownikami do wynajęcia na tej wyspie. O taką renomę trzeba dbać na każdym kroku, więc muszę czujnie pilnować tego miejsca.
uk: Ми – найкращі воїни, яких можна найняти на цьому острові. І щоб підтримувати таку репутацію, мені доводиться уважно стежити за цим місцем.

source: Jesteśmy najważniejszą jednostką wojskową w królestwie. Słyniemy z tego, że potrafimy sobie poradzić z każdym niemożliwym zadaniem.
uk: Ми – найважливіший військовий підрозділ у королівстві. Ми славимося тим, що можемо впоратися з будь-яким нездійсненним завданням.

source: Jesteśmy najzdolniejszymi wojownikami Myrtany, zaraz obok paladynów. Różnimy się od nich tylko tym, że chronimy najważniejszych oficjeli, a nie magów.
uk: Ми – найвправніші воїни Міртани, на рівні з паладинами. Різниця лише в тому, що ми захищаємо найвищих посадових осіб, а не магів.

source: Jesteśmy organizacją podlegającą Gildii Kupieckiej Araxos. My zajmujemy się mapami i organizacją, oni zaś wynajmują nam swoich gońców jako przewodników.
uk: Ми – організація, підпорядкована Торговій Гільдії Араксос. Ми займаємось мапами та організацією, а вони надають нам своїх посланців як провідників.

source: Jesteśmy organizacją podległą Gildii Kupieckiej Araxos. My zajmujemy się mapami i organizacją, oni zaś wynajmują nam swoich gońców jako przewodników.
uk: Ми - організація, підпорядкована Торговій Гільдії Араксос. Ми займаємось мапами та організацією, а вони залучають до нас своїх посланців у якості провідників.

source: Jesteśmy poddawani naprawdę ciężkiej próbie, ale nie możemy teraz zrezygnować. Wszyscy byliśmy przygotowani na to, że sprawy mogą się tak potoczyć.
uk: Нам випало важке випробування, але ми не можемо здатися зараз. Ми всі були готові до того, що все так обернеться.

source: Jesteśmy pokornymi wyznawcami Adanosa, próbującymi żyć zgodnie z jego wolą w tym brutalnym świecie rozdartym konfliktem sług Innosa i Beliara.
uk: Ми - смиренні послідовники Аданоса, які намагаються жити згідно з його волею в цьому жорстокому світі, розірваному на частини конфліктом слуг Інноса і Беліара.

source: Jesteśmy przejazdem.
uk: Ми проходили повз.

source: Jesteśmy przejazdem. Szukamy miejsca, gdzie moglibyśmy odpocząć.
uk: Ми проходили повз. Шукаємо місце, де могли б відпочити.

source: Jesteśmy strażą, nie organizacją dobroczynną. Musisz o tym pamiętać.
uk: Ми – Варта, а не благодійна організація. Пам'ятай про це.

source: Jesteśmy trzema braćmi z kasty.
uk: Ми – три брати з однієї касти.

source: Jesteśmy tu bezpieczni prawda? Morris by nas nie okłamywał. To niemożliwe by coś takiego zrobił...
uk: Ми тут у безпеці, правда? Морріс не став би нам брехати. Він не міг зробити щось подібне...

source: Jesteśmy tu bezpieczni, prawda? Morris by nas nie okłamywał. To niemożliwe, by coś takiego zrobił...
uk: Ми тут у безпеці, правда? Морріс не став би нам брехати. Він не міг зробити щось подібне...

source: Jesteśmy tu i teraz. Dokładnie tacy jacy jesteśmy.
uk: Ми тут і зараз. Саме такі, якими ми є.

source: Jesteśmy tutaj tylko ty i ja. Ani Kessel, ani Ulryk nie mają już żadnego znaczenia.
uk: Тут тільки ти і я. Ні Кессель, ні Ульрік більше не мають жодного значення.

source: Jesteśmy tylko prostymi wędrowcami.
uk: Ми прості мандрівники.

source: Jesteśmy tylko zwykłymi obywatelami, którym przyświeca wspólny cel.
uk: Ми просто звичайні мешканці, які мають спільну мету.

source: Jesteśmy umówieni na konkretną kwotę, pamiętasz?
uk: Ми домовлялися про конкретну суму, пам'ятаєш?

source: Jesteśmy w Przystani. Zabrzmi to dziwnie, ale jest tu bezpieczniej, niż na bagnie.
uk: Ми в Гавані. Це прозвучить дивно, але тут безпечніше, ніж на болотах.

source: Jesteśmy w całkiem nowej sytuacji, nie wiemy do końca, na co możemy sobie pozwolić, a na co nie.
uk: Ми опинилися в абсолютно новій ситуації, і не до кінця розуміємо, що можемо собі дозволити, а що ні.

source: Jesteśmy wycieńczeni, ranni i głodni. Szukamy schronienia.
uk: Ми виснажені, поранені і голодні. Ми шукаємо притулку.

source: Jesteśmy. Dziękuję za wspólny patrol. Teraz idź się przespać, a rano pójdziemy do Rodericha i złożymy mu raport.
uk: Ми прийшли. Дякую за спільне патрулювання. Тепер йди поспи, а вранці ми підемо до Родеріха і відзвітуємо йому.

source: Jesteśmy. Już widzę stąd te cholerstwa!
uk: Ми на місці. Так і є. Я вже бачу звідси цих клятих тварюк!

source: Jesteśmy. Możemy zaczynać?
uk: Ми на місці. Можемо починати?

source: Jeszcze 'przypadkiem' trafię za coś do lochu.
uk: А то ще 'випадково' опинюся у в'язниці за щось.

source: Jeszcze by jej strzeliło do głowy wychodzić za mąż z miłości, a nie rozsądku!
uk: Їй би все одно прийшло в голову вийти заміж по любові, а не по розуму!

source: Jeszcze by mnie któryś z tych wystraszonych wieśniaków wziął za tę ich całą Bestię.
uk: Хтось із переляканих селян міг би прийняти мене за цього Звіра.

source: Jeszcze będzie z ciebie ważna szycha w Gildii. W przeciwieństwie do większości najemników masz więcej rozumu niż mięśni.
uk: З часом ти станеш важливою фігурою в Гільдії. На відміну від більшості найманців, у тебе більше розуму, ніж м'язів.

source: Jeszcze będę miał przez to kłopoty...
uk: У мене ще будуть неприємності через це...

source: Jeszcze całkiem niedawno nakładałem ci gulasz, a dzisiaj proszę! Widzę, że znalazłeś sobie nowych kolegów.
uk: Ще недавно я подавав тобі рагу, а сьогодні ось що! Бачу, ти знайшов собі нових друзів.

source: Jeszcze chwila, a od tego zgiełku i ciągłych rozmów o złotych Innosach pęknie mi głowa.
uk: Ще мить – і моя голова розірветься від метушні та постійних розмов про золотих Інносів.

source: Jeszcze chwila, a pewnie wdarliby się do środka. Uratowałeś mi życie, nigdy ci tego nie zapomnę!
uk: Ще мить, і вони, напевно, увірвалися б всередину. Ти врятував мені життя, я ніколи цього не забуду!

source: Jeszcze ci mało, smarku?
uk: Тобі ще не досить, шмаркачу?

source: Jeszcze ci mało?
uk: Тобі цього мало?

source: Jeszcze ci mało? Jeśli dzięki temu mam dostać robotę, to zrobię to z przyjemnością!
uk: Тобі досі мало? Якщо це допоможе мені знайти роботу, я з радістю це зроблю!

source: Jeszcze ci mało? Młody, nie marnuj mojego czasu.
uk: Тобі ще мало? Юначе, не марнуй мого часу.

source: Jeszcze ci mało?!
uk: Тобі все ще мало?

source: Jeszcze ci się za to oberwie, zobaczysz.
uk: Ти ще отримаєш своє, ось побачиш.

source: Jeszcze cię dorwę!
uk: Я ще до тебе доберусь!

source: Jeszcze cię nie wrzucili do fosy za brak kultury osobistej?
uk: Тебе ще не кинули в рів за твою невихованість?

source: Jeszcze cię tu nie widziałem, chłopcze.
uk: Я тебе тут раніше не бачив, хлопче.

source: Jeszcze coś sprawdzę.
uk: Я ще дещо перевірю.

source: Jeszcze coś!
uk: Ще щось!

source: Jeszcze coś?
uk: Щось ще?

source: Jeszcze coś?!
uk: Ще щось?!

source: Jeszcze czegoś chcesz? Bo jeśli przyszedłeś tylko w tej sprawie, to możesz już sobie iść.
uk: Щось ще? Бо якщо ти прийшов тільки за цим, то можеш йти.

source: Jeszcze czegoś potrzebujesz?
uk: Тобі ще щось потрібно?

source: Jeszcze do niedawna mieliśmy na plaży dodatkowe miejsce do suszenia ryb i odpoczynku po pracy. W pogodne dni nawet je stąd widać, jest kawałek na północny zachód stąd.
uk: Донедавна у нас було додаткове місце на пляжі, де ми сушили рибу і відпочивали після роботи. У сонячні дні його навіть можна побачити звідси, це клаптик землі на північний захід від нас.

source: Jeszcze dziś wybiorę się do niej osobiście przeprosić ją za cały ten bałagan.
uk: Сьогодні я сходжу до неї особисто, щоб вибачитися за весь цей безлад.

source: Jeszcze dziś zadbam o to, byś wylądował w lochach! Będziesz pracował w Górniczej Dolinie, a wszystko to z pożytkiem dla królestwa!
uk: Сьогодні ж я подбаю про те, щоб ти опинився у в'язниці! Ти працюватимеш у Гірничій Долині, і все це на благо королівства!

source: Jeszcze jak! Gdybyś tylko widział minę sędziego! Był tak zadowolony, że sam zaproponował mi oczyszczenie z zarzutów!
uk: Ще б пак! Якби ти тільки бачив обличчя судді! Він був такий задоволений, що сам запропонував мене виправдати!

source: Jeszcze jakieś pytania?
uk: Є ще запитання?

source: Jeszcze jeden bezczelny zwrot i pokażę ci, jak traktujemy niesubordynację w Wilczym Leżu.
uk: Ще один зухвалий вислів, і я покажу тобі, як ми ставимось до непокори у Вовчому Лігві.

source: Jeszcze jeden krok, a pożałujesz. Ostrzegam cię!
uk: Ще один крок, і ти пошкодуєш про це. Я тебе попереджаю!

source: Jeszcze jeden mój cios, a to ty byś gryzł piach.
uk: Ще один удар і ти б жер пісок.

source: Jeszcze jedno słowo, a będę musiał poszukać nowego kwatermistrza. Arwid! Pójdziesz razem z nim.
uk: Ще одне слово, і я буду змушений шукати нового інтенданта. Арвіде! Підеш разом з ним.

source: Jeszcze jedno!
uk: Ще одне...

source: Jeszcze jedno! Niech nikt nie próbuje zbliżyć się bardziej, niż na odległość gdzie stoję ja. Biorąc pod uwagę waszą wprawę w strzelaniu, będziecie już martwi, jeśli przeciwnik dostanie się tak blisko.
uk: І ще одне! Не намагайтеся наблизитися до мене ближче, ніж на відстань, на якій я стою. Враховуючи вашу стрілецьку майстерність, ви вже будете мертві, якщо супротивник підійде так близько.

source: Jeszcze jedno, chłopcze.
uk: І ще одне, хлопче.

source: Jeszcze jedno, jeśli masz przy sobie jakieś bryłki złota, to lepiej nie wchodź z nimi do kopalni. Wychodząc zostaniesz rozliczony ze wszystkich posiadanych!
uk: І ще одне, якщо маєш при собі золоті самородки, то краще не заходь з ними в копальню. На виході доведеться розрахуватися за всі наявні!

source: Jeszcze jedno, trzymałem je na czarną godzinę, może już czas z nich skorzystać.
uk: І ще одне, я тримав їх на чорний день, можливо, настав час їх використати.

source: Jeszcze jedno, wygląda na to, że z tą twierdzą zejdzie nam dłużej niż myśleliśmy. Jeśli masz jakieś otwarte sprawy, to radzę ci się z nimi pośpieszyć. Kto wie, jak długo nas tu nie będzie.
uk: І ще одне, схоже на те, що на дослідження цієї фортеці нам знадобиться більше часу, ніж ми думали. Якщо маєш якісь незавершені справи, раджу поквапитися з ними. Хто знає, як довго нас не буде.

source: Jeszcze jedno. Co tak śmierdzi?
uk: І ще одне. Що так смердить?

source: Jeszcze jedno. Do Huxlaya udaj się wyłącznie wtedy, jeśli nie uda ci się ich sprowokować. Czekam na wyniki.
uk: Ще одне. До Хакслі звертайся лише в тому випадку, якщо тобі не вдасться їх спровокувати. Чекаю на результати.

source: Jeszcze jedno. Gdy byłeś zajęty, ja znalazłem ten kamień w pobliżu.
uk: І ще одне. Поки ти був зайнятий, я знайшов цей камінь неподалік.

source: Jeszcze jedno. Gdy siedzieliśmy w tej jaskini, znalazłam ten kamień.
uk: І ще одне. Коли ми сиділи в тій печері, я знайшла цей камінь.

source: Jeszcze jedno. Tylko uprawnione osoby mogą chodzić w barwach Araxos w kopalni. Z tego też powodu, zaopiekuję się twoim wyposażeniem.
uk: І ще одне. Лише ті, хто має на це право, можуть ходити в кольорах Араксосу в копальні. Тому я подбаю про твоє спорядження.

source: Jeszcze jedno...
uk: Ще одне...

source: Jeszcze jedno... znalazłem tego łowcę.
uk: І ще одне... Я знайшов того слідопита.

source: Jeszcze jutro wyślę do niego gońców z pierwszym transportem.
uk: Вже завтра я пошлю до нього посланців з першим транспортом.

source: Jeszcze kiedyś nadarzy się okazja, prawda?
uk: Адже колись буде інша можливість, правда?

source: Jeszcze kilka dni czekania i kto wie, czy nie obudziłby nas w nocy odgłos orkowych bębnów wojennych.
uk: Ще кілька днів зволікання, і хто знає, чи не розбудив би нас вночі звук бойових барабанів орків.

source: Jeszcze kilka lat i moje posążki będą sprzedawane w całej Myrtanie.
uk: Ще кілька років, і мої статуетки будуть продаватися по всій Міртані.

source: Jeszcze kilka lat wstecz każdy słyszał o Cortezie i jego bandzie. Gdybym ci opowiedział o naszych akcjach... Ach nie uwierzyłbyś.
uk: Ще кілька років тому кожен чув про Кортеза і його команду. Я б розповів про наш промисел... та ти все одно не повіриш.

source: Jeszcze krok, a poczujesz moje ostrze!
uk: Ще один крок, і ти відчуєш мій клинок!

source: Jeszcze mam na tyle godności, żeby nie paradować po mieście w babskiej sukni.
uk: У мене ще вистачає гідності, щоб не розгулювати містом в жіночій сукні.

source: Jeszcze masz czelność się tu zjawiać?! Wynoś się natychmiast!
uk: Ти ще маєш нахабство приходити сюди?! Забирайся звідси негайно!

source: Jeszcze masz wątpliwości?
uk: Все ще сумніваєшся?

source: Jeszcze moment, tutaj jest tego tak dużo...
uk: Ще хвилиночку, тут так багато всього...

source: Jeszcze nic. Nawet się nie rozgrzałem. Skoro nasz kolega odzyskał już przytomność, możemy zaczynać!
uk: Поки що нічого. Я навіть не розім'явся. Тепер, коли наш колега прийшов до тями, можемо починати!

source: Jeszcze nie czuję się tutaj jak u siebie, ale jestem na dobrej drodze.
uk: Поки що я не відчуваю себе тут як вдома, але я на правильному шляху.

source: Jeszcze nie dopłynęliśmy do brzegu, a ty już szukasz guza?
uk: Ми ще не допливли до берега, а ти вже шукаєш пригод?

source: Jeszcze nie doszły do mnie wieści odnośnie waszej aktywności w porcie, a to może znaczyć dwie rzeczy, albo się obijałeś, albo naprawdę wziąłeś sobie do serca moje słowa.
uk: Я досі не отримував від тебе звісток щодо діяльності в порту, а це може означати тільки дві речі: або ти не поспішаєш, або ти справді сприйняв мої слова дуже серйозно.

source: Jeszcze nie jest za późno, żebyś naprawił swój błąd.
uk: Ще не пізно виправити свою помилку.

source: Jeszcze nie jestem gotowy.
uk: Я ще не готовий.

source: Jeszcze nie mam wszystkiego.
uk: Я ще не все дістав.

source: Jeszcze nie przepytaliśmy świadków, więc nie mamy pełnego spektrum.
uk: Ми ще не опитали свідків, тому не маємо повної картини.

source: Jeszcze nie przyzwyczaiłeś się do Archolos i już tęsknisz za rodzinnymi stronami?
uk: Ще не встиг освоїтися на Архолосі, а вже сумуєш за рідними краєм?

source: Jeszcze nie rozmawiałem z Lorenzo.
uk: Я ще не говорив з Лоренцо.

source: Jeszcze nie skończyliśmy z tym orkiem.
uk: Ми ще не закінчили з тим орком.

source: Jeszcze nie słyszałeś? Większość nieprzychylnych mi osób uwielbia używać nazwy mojego zawodu jako haniebnego przezwiska. Potajemnie zwą mnie Lichwiarzem.
uk: Ти ще не чув? Більшість недоброзичливих до мене людей люблять використовувати назву моєї професії як ганебне прізвисько. Потайки називають мене Лихварем.

source: Jeszcze nie udało mi się ich spełnić.
uk: Поки що я не зміг їх виконати.

source: Jeszcze nie zauważyłeś, że to właśnie egoizm i dążenie po trupach ściągnęły na nas to wszystko?
uk: Хіба ти ще не помітив, що саме егоїзм і жага крові спричинили все це?

source: Jeszcze nie znalazłem odpowiedniego miejsca.
uk: Я ще не знайшов підходяще місце.

source: Jeszcze nie znaleziono nikogo,
uk: Поки що нема нікого, хто б відмовився

source: Jeszcze nie zwariowałem!
uk: Я ще не збожеволів!

source: Jeszcze nie, ale chyba jestem na tropie.
uk: Ще ні, але певно йду по сліду.

source: Jeszcze nie, wrócę niebawem.
uk: Не зараз, я скоро повернуся.

source: Jeszcze nie.
uk: Поки що ні.

source: Jeszcze nie. Niedługo dostaną to, na co zasługują.
uk: Ще ні. Але скоро вони отримають те, на що заслуговують.

source: Jeszcze nie. Oto pieniądze.
uk: Ще ні. Ось гроші.

source: Jeszcze niedawno mówiłem ci o ofercie Weigara, a teraz Winstan chce cię widzieć jako szermierza!
uk: Нещодавно я розповідав тобі про пропозицію Вейгара, а тепер Вінстан хоче бачити тебе мечником!

source: Jeszcze parę lat temu miałabym z tym problem, ale dzisiaj wiem, że tylko dzięki Gildii Kupieckiej handel w królestwie jeszcze jakoś się trzyma.
uk: Кілька років тому у мене були б з цим проблеми, але сьогодні я знаю, що тільки завдяки Торговій Гільдії торгівля в королівстві ще хоч якось тримається.

source: Jeszcze po jednym?
uk: Ще по одній?

source: Jeszcze przyjdzie czas, kiedy mój miecz zgładzi tabuny tych bestii. Przysłano mnie tutaj z arcyważną misją.
uk: Ще прийде час, коли мій меч знищить орди цих тварюк. Мене послали сюди з надзвичайно важливою місією.

source: Jeszcze pytasz? Jasne, że chcę! Skoro i tak stoję tu na warcie, to miło by było mieć jakieś przyjaciela do wspólnego pilnowania.
uk: Ти ще питаєш? Звичайно, хочу! Оскільки я все одно стою тут на варті, було б непогано мати товариша, щоб разом пильнувати.

source: Jeszcze raz - dzięki za pomoc. Gdybyś jeszcze kiedyś trafił na jakiś wyjątkowy okaz, to wiesz gdzie mnie szukać.
uk: Ще раз дякую за допомогу. Якщо тобі ще колись трапиться якийсь винятковий екземпляр, ти знаєш, де мене знайти.

source: Jeszcze raz bardzo dziękuję ci za pomoc. Nigdy ci tego nie zapomnę.
uk: Ще раз дуже дякую за допомогу. Я ніколи цього не забуду.

source: Jeszcze raz ci dziękuję! Weź proszę chociaż te kilka zwojów w ramach nagrody.
uk: Ще раз дякую! Будь ласка, візьми хоча б ці кілька сувоїв у винагороду.

source: Jeszcze raz ci dziękuję. Proszę, przyjmij to złoto jako dowód mojej wdzięczności.
uk: Ще раз тобі дякую. Будь ласка, прийми це золото на знак моєї вдячності.

source: Jeszcze raz ci mówię, że to nie był żaden mój pracownik, tylko jakiś przybłęda z bardzo pospolitym imieniem!
uk: Я ще раз кажу, це був не мій працівник, а якийсь приблуда з дуже поширеним ім'ям!

source: Jeszcze raz dzięki za pomoc!
uk: Ще раз дякую за допомогу!

source: Jeszcze raz dzięki za tą sprawę w kopalni.
uk: Ще раз дякую за допомогу в копальні.

source: Jeszcze raz dzięki za zaufanie mi!
uk: Ще раз дякую за довіру!

source: Jeszcze raz dziękuję za pomoc! Zebrałem to po drodze - może ci się przyda.
uk: Ще раз дякую за допомогу! Я зібрав це дорогою сюди – можливо, тобі знадобиться.

source: Jeszcze raz dziękuję za twoją pomoc.
uk: Ще раз дякую за допомогу.

source: Jeszcze raz mnie tak nazwiesz, to wybiję ci twoje piękne ząbki moim... He, toporem!
uk: Ще раз так мене назвеш, і я виб'ю твої гарні зуби своєю... Хе, сокирою!

source: Jeszcze raz podniesiesz na nas rękę, to ci ją utnę.
uk: Ще раз піднімеш на нас руку – і я її відрубаю.

source: Jeszcze raz, a się doigrasz...
uk: Ще раз і ти дограєшся...

source: Jeszcze raz, stokrotne dzięki.
uk: Ще раз, безмежно дякую!

source: Jeszcze raz: skąd masz ten grot?
uk: Ще раз: звідки у тебе цей наконечник?

source: Jeszcze razem nie pracowaliśmy.
uk: Ми ще не працювали разом.

source: Jeszcze się nie zjawił?
uk: Він ще не з'явився?

source: Jeszcze się policzymy!
uk: Ми не закінчили!

source: Jeszcze się policzymy, spryciarzu...
uk: Ми ще поговоримо, розумнику...

source: Jeszcze się policzymy...
uk: Ми ще поквитаємось...

source: Jeszcze się przekonasz, gdy spotkamy się tu za jakiś czas.
uk: Ти ще зміниш свою думку, коли ми знову зустрінемось тут через якийсь час.

source: Jeszcze się pytasz? Dzięki temu kontraktowi będę bogaty, wszystko jest w jak najlepszym porządku!
uk: Ти ще питаєш? Завдяки цьому контракту я розбагатію, все буде як ніколи добре!

source: Jeszcze się pytasz? Nowy mistrz areny, ciągle nie potrafię się do tego przyzwyczaić. Żeby ci to tylko do głowy nie uderzyło!
uk: Ти ще питаєш? Новий чемпіон арени, я все ще не можу звикнути до цього. Тільки не втрать від цього голову!

source: Jeszcze się pytasz? Po tym, co sobie nasz król wymyślił z sukienkami zamiast pancerzy?
uk: Ти все ще задаєшся цим питанням? Після того, як наш король додумався до суконь замість обладунків?

source: Jeszcze się pytasz? Wulkan omal nas nie zabił, więc się cieszę, że żyję!
uk: Ти ще питаєш? Вулкан ледь не вбив нас, тому я радий, що залишився живий!

source: Jeszcze się pytasz? Z której nory wylazłeś, że się nie orientujesz w sytuacji?
uk: Ти ще питаєш? З якої нори ти виліз, що не орієнтуєшся в ситуації?

source: Jeszcze się z tobą policzę! Obiecuję ci!
uk: Я ще з тобою розберуся! Обіцяю!

source: Jeszcze się zastanowię.
uk: Я ще подумаю над цим.

source: Jeszcze szukasz guza, smarkaczu?
uk: Все ще шукаєш пригод, шмаркач?

source: Jeszcze słowo, a dostaniesz podwójną karę za zniesławienie mojej przyjaciółki!
uk: Ще слово, і ти отримаєш подвійне покарання за наклеп на мою подругу!

source: Jeszcze tak trochę potrzęsie, a zwrócę cały obiad!
uk: Ще одна така хитавиця, і з мене вийде весь обід!

source: Jeszcze tego brakowało, teraz zaginął również Sunder. Mam nadzieję, że nie spotkał go taki sam los, co tego kowala. Na drodze w kierunku wioski chyba widzę kufel, może zaprowadzi mnie do Sundera... albo tego, co z niego zostało.
uk: Тільки цього мені бракувало, тепер ще й Сандер зник. Сподіваюся, його не спіткала та ж сама доля, як цього коваля. Посеред дороги до села я, здається, бачив якийсь кухоль. Можливо, він приведе мене до Сандера... Або до того, що від нього залишилося.

source: Jeszcze to rozważam.
uk: Я все ще роздумую над цим.

source: Jeszcze trochę i ja będę musiał żebrać.
uk: Ще трохи, і мені доведеться благати.

source: Jeszcze trochę i siłą wejdziemy do środka. Co prawda czeka nas wtedy zesłanie do Górniczej Doliny, ale trudno!
uk: Ще трохи, і ми силоміць зайдемо всередину. Щоправда, після цього на нас чекає заслання до Гірничої Долини, але яка різниця!

source: Jeszcze trochę treningu przed tobą, jesteś na dobrej drodze.
uk: Попереду ще кілька тренувань, ти на правильному шляху.

source: Jeszcze trochę, a będziemy chodzić w łachmanach i machać naostrzonymi patykami!
uk: Ще трохи, і ми будемо ходити в лахмітті та розмахувати загостреними палицями!

source: Jeszcze trochę, a zostaniesz prawdziwym magiem!
uk: Ще трохи – і ти станеш справжнім магом!

source: Jeszcze trochę, a zostanę specjalistą w przeczesywaniu terenów podmokłych.
uk: Ще трохи, і я стану спеціалістом з прочісування мокрої місцевості.

source: Jeszcze tu jesteś?
uk: Ти ще тут?

source: Jeszcze tylko kilka...
uk: Залишилось ще трохи...

source: Jeszcze tylko przejrzę parę tych skrzyń i czeka mnie zimne, orzeźwiające piwko.
uk: Я збираюся перебрати ще кілька скринь, і на мене чекає холодне освіжаюче пиво.

source: Jeszcze więcej czerwonych w okolicy? Jesteś pewny, że był strażnikiem?
uk: Ще більше червоних в нашій місцевості? Ти впевнений, що він був вартовим?

source: Jeszcze więcej? Moje wskazówki to za mało?
uk: Ще більше? Моїх порад замало?

source: Jeszcze większy z ciebie cwaniak niż ze mnie, nie chciałbyś mi pomóc z pewną sprawą?
uk: Ти ще більший придурок, ніж я. Не хочеш допомогти мені з однією справою?

source: Jeszcze wrócimy do tej rozmowy.
uk: Ми ще повернемося до цієї розмови.

source: Jeszcze zobaczymy chłopcze, kto od czego będzie musiał się wywinąć... jeszcze zobaczymy...
uk: Ще побачимо, хлопче, кому доведеться шукати виправдання... ще побачимо...

source: Jeszcze zobaczymy...
uk: Ще побачимо...

source: Jeszcze żyję, więc nie jest źle. Przydałoby się jednak jakieś lepsze posłanie...
uk: Я досі живий, тож все не так вже й погано. Хоча ліжко могло б бути й кращим...

source: Jeśli Ben cię jednak trafi, ważne, żebyś nie padł po pierwszym ciosie. Zhańbiłbyś nie tylko siebie, ale i mnie jako osobę, która z tobą przegrała.
uk: Якщо Бен тебе вдарить, важливо, щоб ти не впав після першого ж удару. Ти зганьбиш не тільки себе, але й мене як людину, яка тобі програла.

source: Jeśli Ben zechce dodać cię do swojej kolekcji trofeów, to nikt nie będzie mógł ci pomóc, nawet sam Adanos.
uk: Якщо Бен захоче додати тебе до своєї колекції трофеїв, ніхто не зможе тобі допомогти, навіть сам Аданос.

source: Jeśli Cortez straci jedno ze swoich źródeł dochodu, to trochę go to zaboli, ale z głodu nie zdechnie. Co innego ja.
uk: Якщо Кортез втратить одне з джерел доходу, йому це трохи нашкодить, але з голоду він не помре. А в мене інша ситуація.
